//dp
#include <iostream>
using namespace std;

int dp[100001];
int main(){
    int n,k;
    cin>>n>>k;
    int c[n+1];
    for(int i=0;i<n;i++){
        cin>>c[i];
    }
    
    dp[0]=1;

    for(int i=0;i<n;i++){//각 동전
        for(int j=c[i];j<=k;j++){//내가 x원짜리를 이용해서 금액을 만들려면 금액이 최소x원보다는 커야함. 따라서 최소금액이 c[i]
            dp[j]+=dp[j-c[i]];
        }
    }
    cout<<dp[k];
    return 0;
}


/*
1   1   1
2   2   11      2
2   3   111     21
3   4   1111    211     22
4   5   11111   2111    221                                         5
5   6   111111  21111   2211   222                                  51  
6   7   1111111 211111  22111  2221                                 511     52
7   8  11111111 2111111 221111 22211 2222                           5111    521
8   9   111111111   21111111    2211111 222111  22221               51111   5211    522
10  10  1111111111  211111111   22111111    2221111 222211  22222   511111  52111   5221    55
*/